---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsRailingBalusterSpacingType
source: html/21f23166-51b3-ef85-ccf0-7fcfe893e460.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsRailingBalusterSpacingType Property

"Baluster Spacing Type (Stair Railing Only)"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsRailingBalusterSpacingType { get; }
```